# Filtering & query() method

In [2]:
import numpy as np 
import pandas as pd

In [3]:
oil = pd.read_csv(r"E:\Devu\USB Drive\coding\pandas-from-scratch\notebooks\Sec-3_DataFrameIntro\oil.csv")
oil

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [12]:
oil.loc[oil["date"]== "2017-08-28"]

            date  dcoilwtico
1214  2017-08-28        46.4

In [21]:
oil.loc[oil["dcoilwtico"]==47.26 , ["dcoilwtico"]]

      dcoilwtico
1217       47.26

In [42]:
mask = (oil["dcoilwtico"]>90) &( oil["date"].str[:4]=="2013")
oil[mask]

           date  dcoilwtico
1    2013-01-02       93.14
2    2013-01-03       92.97
3    2013-01-04       93.12
4    2013-01-07       93.20
5    2013-01-08       93.21
..          ...         ...
255  2013-12-24       98.87
257  2013-12-26       99.18
258  2013-12-27       99.94
259  2013-12-30       98.90
260  2013-12-31       98.17

[245 rows x 2 columns]

In [55]:
oil.query("date in ['2013-12-27','2013-12-30'] and dcoilwtico > 90")

           date  dcoilwtico
258  2013-12-27       99.94
259  2013-12-30       98.90

In [56]:
oil.date.dtype

dtype('O')

In [60]:
avg_dcoilwtico=oil["dcoilwtico"].mean()
avg_dcoilwtico

67.71436595744682

In [59]:
oil.query("date in ['2013-12-27','2013-12-30'] and dcoilwtico > @avg_dcoilwtico")

           date  dcoilwtico
258  2013-12-27       99.94
259  2013-12-30       98.90